{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_38", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 1, 1404], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_39"}, "name": "input_39", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_48", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_48", "inbound_nodes": [[["input_39", 0, 0, {}]]]}, {"class_name": "SimpleRNN", "config": {"name": "simple_rnn_76", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "simple_rnn_76", "inbound_nodes": [[["batch_normalization_48", 0, 0, {}]]]}, {"class_name": "SimpleRNN", "config": {"name": "simple_rnn_77", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "simple_rnn_77", "inbound_nodes": [[["simple_rnn_76", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_49", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_49", "inbound_nodes": [[["simple_rnn_77", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_120", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_120", "inbound_nodes": [[["batch_normalization_49", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_121", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_121", "inbound_nodes": [[["batch_normalization_49", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_122", "trainable": true, "dtype": "float32", "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_122", "inbound_nodes": [[["batch_normalization_49", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_38", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_38", "inbound_nodes": [[["dense_120", 0, 0, {}], ["dense_121", 0, 0, {}], ["dense_122", 0, 0, {}]]]}], "input_layers": [["input_39", 0, 0]], "output_layers": [["concatenate_38", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_48/gamma", "shape": [1404], "dtype": "float32"}, {"name": "batch_normalization_48/beta", "shape": [1404], "dtype": "float32"}, {"name": "batch_normalization_48/moving_mean", "shape": [1404], "dtype": "float32"}, {"name": "batch_normalization_48/moving_variance", "shape": [1404], "dtype": "float32"}, {"name": "batch_normalization_49/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_49/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_49/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_49/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "dense_120/kernel", "shape": [128, 4], "dtype": "float32"}, {"name": "dense_120/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_121/kernel", "shape": [128, 3], "dtype": "float32"}, {"name": "dense_121/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_122/kernel", "shape": [128, 7], "dtype": "float32"}, {"name": "dense_122/bias", "shape": [7], "dtype": "float32"}, {"name": "simple_rnn_76/simple_rnn_cell_84/kernel", "shape": [1404, 128], "dtype": "float32"}, {"name": "simple_rnn_76/simple_rnn_cell_84/recurrent_kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "simple_rnn_76/simple_rnn_cell_84/bias", "shape": [128], "dtype": "float32"}, {"name": "simple_rnn_77/simple_rnn_cell_85/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "simple_rnn_77/simple_rnn_cell_85/recurrent_kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "simple_rnn_77/simple_rnn_cell_85/bias", "shape": [128], "dtype": "float32"}]}]}