{
  "format": "layers-model",
  "generatedBy": "keras v2.5.0",
  "convertedBy": "TensorFlow.js Converter v3.6.0",
  "modelTopology": {
    "keras_version": "2.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_11",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [1, 1, 1404],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_12"
            },
            "name": "input_12",
            "inbound_nodes": []
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_17",
              "trainable": true,
              "dtype": "float32",
              "axis": [2],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_17",
            "inbound_nodes": [[["input_12", 0, 0, {}]]]
          },
          {
            "class_name": "SimpleRNN",
            "config": {
              "name": "simple_rnn_25",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "shared_object_id": 6
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "shared_object_id": 7
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 8
              },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            },
            "name": "simple_rnn_25",
            "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]
          },
          {
            "class_name": "SimpleRNN",
            "config": {
              "name": "simple_rnn_26",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "shared_object_id": 11
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "shared_object_id": 12
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "shared_object_id": 13
              },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            },
            "name": "simple_rnn_26",
            "inbound_nodes": [[["simple_rnn_25", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_33",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_33",
            "inbound_nodes": [[["simple_rnn_26", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_34",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_34",
            "inbound_nodes": [[["simple_rnn_26", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_35",
              "trainable": true,
              "dtype": "float32",
              "units": 7,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_35",
            "inbound_nodes": [[["simple_rnn_26", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_11",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_11",
            "inbound_nodes": [
              [
                ["dense_33", 0, 0, {}],
                ["dense_34", 0, 0, {}],
                ["dense_35", 0, 0, {}]
              ]
            ]
          }
        ],
        "input_layers": [["input_12", 0, 0]],
        "output_layers": [["concatenate_11", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_17/gamma",
          "shape": [1404],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_17/beta",
          "shape": [1404],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_17/moving_mean",
          "shape": [1404],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_17/moving_variance",
          "shape": [1404],
          "dtype": "float32"
        },
        {
          "name": "dense_33/kernel",
          "shape": [128, 4],
          "dtype": "float32"
        },
        {
          "name": "dense_33/bias",
          "shape": [4],
          "dtype": "float32"
        },
        {
          "name": "dense_34/kernel",
          "shape": [128, 3],
          "dtype": "float32"
        },
        {
          "name": "dense_34/bias",
          "shape": [3],
          "dtype": "float32"
        },
        {
          "name": "dense_35/kernel",
          "shape": [128, 7],
          "dtype": "float32"
        },
        {
          "name": "dense_35/bias",
          "shape": [7],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_25/simple_rnn_cell_31/kernel",
          "shape": [1404, 128],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_25/simple_rnn_cell_31/recurrent_kernel",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_25/simple_rnn_cell_31/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_26/simple_rnn_cell_32/kernel",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_26/simple_rnn_cell_32/recurrent_kernel",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_26/simple_rnn_cell_32/bias",
          "shape": [128],
          "dtype": "float32"
        }
      ]
    }
  ]
}
