{
  "format": "layers-model",
  "generatedBy": "keras v2.6.0",
  "convertedBy": "TensorFlow.js Converter v3.8.0",
  "modelTopology": {
    "keras_version": "2.6.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                256,
                256,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_2",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      256,
                      256,
                      3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_1_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_1",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_2",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_3",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      128,
                      128,
                      64
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_2_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_2",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_3",
            "inbound_nodes": [
              [
                [
                  "sequential_2",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_4",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      64,
                      64,
                      128
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_3_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_3",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_3",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_4",
            "inbound_nodes": [
              [
                [
                  "sequential_3",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_5",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      32,
                      32,
                      256
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_4_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_4",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_4",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_5",
            "inbound_nodes": [
              [
                [
                  "sequential_4",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_6",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      16,
                      16,
                      512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_5_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_5",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_5",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_6",
            "inbound_nodes": [
              [
                [
                  "sequential_5",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_7",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      8,
                      8,
                      512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_6_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_6",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_6",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_6",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_7",
            "inbound_nodes": [
              [
                [
                  "sequential_6",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_8",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      4,
                      4,
                      512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_7_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_7",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_7",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_7",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_8",
            "inbound_nodes": [
              [
                [
                  "sequential_7",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_9",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      2,
                      2,
                      512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_8_input"
                  }
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_8",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_8",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "LeakyReLU",
                  "config": {
                    "name": "leaky_re_lu_8",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha": 0.30000001192092896
                  }
                }
              ]
            },
            "name": "sequential_9",
            "inbound_nodes": [
              [
                [
                  "sequential_8",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_10",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      1,
                      1,
                      512
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_transpose_1_input"
                  }
                },
                {
                  "class_name": "Conv2DTranspose",
                  "config": {
                    "name": "conv2d_transpose_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_9",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_1",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  }
                }
              ]
            },
            "name": "sequential_10",
            "inbound_nodes": [
              [
                [
                  "sequential_9",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
              [
                [
                  "sequential_10",
                  1,
                  0,
                  {}
                ],
                [
                  "sequential_8",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_11",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      2,
                      2,
                      1024
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_transpose_2_input"
                  }
                },
                {
                  "class_name": "Conv2DTranspose",
                  "config": {
                    "name": "conv2d_transpose_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_10",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_2",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  }
                }
              ]
            },
            "name": "sequential_11",
            "inbound_nodes": [
              [
                [
                  "concatenate",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_1",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_1",
            "inbound_nodes": [
              [
                [
                  "sequential_11",
                  1,
                  0,
                  {}
                ],
                [
                  "sequential_7",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_12",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      4,
                      4,
                      1024
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_transpose_3_input"
                  }
                },
                {
                  "class_name": "Conv2DTranspose",
                  "config": {
                    "name": "conv2d_transpose_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_11",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_2",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                  }
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_3",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  }
                }
              ]
            },
            "name": "sequential_12",
            "inbound_nodes": [
              [
                [
                  "concatenate_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_2",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate_2",
            "inbound_nodes": [
              [
                [
                  "sequential_12",
                  1,
                  0,
                  {}
                ],
                [
                  "sequential_6",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_13",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      8,
                      8,
                      1024
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_transpose_4_input"
                  }
                },
                {
                  "class_name": "Conv2DTranspose",
                  "config": {
                    "name": "conv2d_transpose_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_size": [
                      4,
                      4
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "RandomNormal",
                      "config": {
                        "mean": 0.0,
                        "stddev": 0.02,
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                  }
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_12",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  }
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_4",
                    "trainable": true,
