{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "tgt",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [1, 1, 63],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "simple_rnn_21_input"
            }
          },
          {
            "class_name": "SimpleRNN",
            "config": {
              "name": "simple_rnn_21",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            }
          },
          {
            "class_name": "SimpleRNN",
            "config": {
              "name": "simple_rnn_22",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            }
          },
          {
            "class_name": "SimpleRNN",
            "config": {
              "name": "simple_rnn_23",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            }
          },
          {
            "class_name": "LayerNormalization",
            "config": {
              "name": "layer_normalization_7",
              "trainable": true,
              "dtype": "float32",
              "axis": [2],
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_7",
              "trainable": true,
              "dtype": "float32",
              "units": 261,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": {
        "class_name": "CategoricalCrossentropy",
        "config": {
          "reduction": "auto",
          "name": "categorical_crossentropy",
          "from_logits": true,
          "label_smoothing": 0
        }
      },
      "metrics": [
        [
          {
            "class_name": "CategoricalAccuracy",
            "config": {
              "name": "categorical_accuracy",
              "dtype": "float32"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "dense_7/kernel",
          "shape": [64, 261],
          "dtype": "float32"
        },
        {
          "name": "dense_7/bias",
          "shape": [261],
          "dtype": "float32"
        },
        {
          "name": "layer_normalization_7/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "layer_normalization_7/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_21/simple_rnn_cell_21/kernel",
          "shape": [63, 64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_21/simple_rnn_cell_21/recurrent_kernel",
          "shape": [64, 64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_21/simple_rnn_cell_21/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_22/simple_rnn_cell_22/kernel",
          "shape": [64, 64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_22/simple_rnn_cell_22/recurrent_kernel",
          "shape": [64, 64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_22/simple_rnn_cell_22/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_23/simple_rnn_cell_23/kernel",
          "shape": [64, 64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_23/simple_rnn_cell_23/recurrent_kernel",
          "shape": [64, 64],
          "dtype": "float32"
        },
        {
          "name": "simple_rnn_23/simple_rnn_cell_23/bias",
          "shape": [64],
          "dtype": "float32"
        }
      ]
    }
  ]
}
